DROP DATABASE IF EXISTS calog;

CREATE DATABASE IF NOT EXISTS calog;

USE calog;

# 유저 테이블
CREATE TABLE user (
	id INT AUTO_INCREMENT PRIMARY KEY,
    user_id VARCHAR(20),
    user_pw VARCHAR(60),
    nickname VARCHAR(30)
);
INSERT INTO user (user_id,user_pw,nickname)VALUES
('abc','123','짱우'),
('ssafy','123','혜만');


# 이벤트 테이블
CREATE TABLE event (
	id INT AUTO_INCREMENT PRIMARY KEY,
    event_name VARCHAR(100),
	sport VARCHAR(10), #마라톤, 배드민턴 등 종목
    event_date DATETIME,
    address VARCHAR(200),
    city VARCHAR(20),
    registration_start DATETIME,
    registration_deadline DATETIME,
    img LONGTEXT
);


# 참가 대회 목록 테이블
CREATE TABLE participation (
		id INT AUTO_INCREMENT PRIMARY KEY,
		memo VARCHAR(255),
        completion_time TIME,
        ranking INT,
        img LONGTEXT,
        detail VARCHAR(60),
        updated_at DATETIME DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
        event_id INT,
        user_id INT,
        FOREIGN KEY (event_id) REFERENCES event(id),
	    FOREIGN KEY (user_id) REFERENCES user(id)
);

# 상세 대회 정보 테이블
CREATE TABLE detail (
	id INT AUTO_INCREMENT PRIMARY KEY,
    category VARCHAR(50), -- 세부종목 (ex. 5km, 10km)
    event_id INT,
    FOREIGN KEY (event_id) REFERENCES event(id)
);

INSERT INTO event (event_name, sport, event_date, address, city, registration_start, registration_deadline)
VALUES
('서울국제마라톤', '마라톤', '2024-10-20', '서울특별시 송파구 올림픽로 424', '서울', '2024-08-20', '2024-09-20'),
('춘천마라톤', '마라톤', '2024-10-27', '강원도 춘천시 스포츠타운길 113', '강원', '2024-08-27', '2024-09-27'),
('경주국제마라톤', '마라톤', '2024-11-03', '경북 경주시 신평동 375', '경상', '2024-09-03', '2024-10-03'),
('제주국제마라톤', '마라톤', '2024-11-10', '제주특별자치도 제주시 애월읍 곽지리 1565', '제주', '2024-09-10', '2024-10-10'),
('대구국제마라톤', '마라톤', '2024-11-17', '대구 달서구 두류동 산 310-9', '대구', '2024-09-17', '2024-10-17'),
('부산마라톤', '마라톤', '2024-11-24', '부산 해운대구 우동', '부산', '2024-09-24', '2024-10-24'),
('광주마라톤', '마라톤', '2024-12-01', '광주 서구 치평동 1162', '광주', '2024-10-01', '2024-11-01'),
('인천송도마라톤', '마라톤', '2024-12-08', '인천 연수구 송도동 24-5', '인천', '2024-10-08', '2024-11-08'),
('울산마라톤', '마라톤', '2024-12-15', '울산 중구 태화동 107', '울산', '2024-10-15', '2024-11-15'),
('세종마라톤', '마라톤', '2024-12-22', '세종특별자치시 세종동 1201', '세종', '2024-10-22', '2024-11-22'),
('통영트라이애슬론', '철인3종', '2024-10-15', '경남 통영시 도남동', '경상', '2024-08-15', '2024-09-15'),
('서울트라이애슬론', '철인3종', '2024-10-22', '서울 서초구 신반포로11길 40', '서울', '2024-08-22', '2024-09-22'),
('부산트라이애슬론', '철인3종', '2024-11-05', '부산 수영구 광안해변로 219', '부산', '2024-09-05', '2024-10-05'),
('제주트라이애슬론', '철인3종', '2024-11-12', '제주특별자치도 서귀포시 색달동 3039', '제주', '2024-09-12', '2024-10-12'),
('대전트라이애슬론', '철인3종', '2024-11-19', '대전 서구 둔산대로 169', '대전', '2024-09-19', '2024-10-19'),
('광주트라이애슬론', '철인3종', '2024-11-26', '광주 광산구 수완동 1411', '광주', '2024-09-26', '2024-10-26'),
('인천트라이애슬론', '철인3종', '2024-12-03', '인천 중구 북성동1가 125', '인천', '2024-10-03', '2024-11-03'),
('울산트라이애슬론', '철인3종', '2024-12-10', '울산 동구 등대로 140', '울산', '2024-10-10', '2024-11-10'),
('세종트라이애슬론', '철인3종', '2024-12-17', '세종특별자치시 중앙공원로 60', '세종', '2024-10-17', '2024-11-17'),
('강원트라이애슬론', '철인3종', '2024-12-24', '강원특별자치도 강릉시 창해로 514', '강원', '2024-10-24', '2024-11-24');


INSERT INTO event (event_name, sport, event_date, address, city, registration_start, registration_deadline)
VALUES
('서울그란폰도', '그랑폰도', '2024-10-18', '서울 중구 남산공원길 125-54', '서울', '2024-08-18', '2024-09-18'),
('부산그란폰도', '그랑폰도', '2024-10-25', '부산 금정구 금성동 1097', '부산', '2024-08-25', '2024-09-25'),
('대구그란폰도', '그랑폰도', '2024-11-02', '대구 동구 팔공산로185길 51', '대구', '2024-09-02', '2024-10-02'),
('인천그란폰도', '그랑폰도', '2024-11-09', '인천 강화군 불은면 중앙로 602-14', '인천', '2024-09-09', '2024-10-09'),
('광주그란폰도', '그랑폰도', '2024-11-16', '광주 북구 금곡동 산 1-3', '광주', '2024-09-16', '2024-10-16'),
('대전그란폰도', '그랑폰도', '2024-11-23', '대전 대덕구 장동 산 108-1 계족산', '대전', '2024-09-23', '2024-10-23'),
('울산그란폰도', '그랑폰도', '2024-12-01', '울산 울주군 상북면 등억알프스리 산 180', '울산', '2024-10-01', '2024-11-01'),
('세종그란폰도', '그랑폰도', '2024-12-08', '세종특별자치시 한솔동 1249', '세종', '2024-10-08', '2024-11-08'),
('강원그란폰도', '그랑폰도', '2024-12-15', '강원특별자치도 양양군 서면 오색리', '강원', '2024-10-15', '2024-11-15'),
('제주그란폰도', '그랑폰도', '2024-12-22', '제주특별자치도 제주시 구좌읍 종달리 산 28', '제주', '2024-10-22', '2024-11-22'),
('서울오픈테니스대회', '테니스', '2024-10-20', '서울 송파구 올림픽로 25', '서울', '2024-08-20', '2024-09-20'),
('부산오픈테니스대회', '테니스', '2024-10-27', '부산광역시 동래구 사직로 45', '부산', '2024-08-27', '2024-09-27'),
('대구테니스챌린지', '테니스', '2024-11-03', '대구광역시 북구 고성로 191', '대구', '2024-09-03', '2024-10-03'),
('인천국제테니스대회', '테니스', '2024-11-10', '인천광역시 연수구 센트럴로 263', '인천', '2024-09-10', '2024-10-10'),
('광주오픈테니스대회', '테니스', '2024-11-17', '광주 서구 월드컵4강로 277', '광주', '2024-09-17', '2024-10-17'),
('대전테니스챌린지', '테니스', '2024-11-24', '대전 유성구 엑스포로 448', '대전', '2024-09-24', '2024-10-24'),
('울산테니스페스티벌', '테니스', '2024-12-01', '울산 남구 문수로 44', '울산', '2024-10-01', '2024-11-01'),
('세종테니스페스티벌', '테니스', '2024-12-08', '세종특별자치시 조치원읍 대첩로 98', '세종', '2024-10-08', '2024-11-08'),
('강원테니스챌린지', '테니스', '2024-12-15', '강원특별자치도 춘천시 스포츠타운길 124-1', '강원', '2024-10-15', '2024-11-15'),
('제주테니스페스티벌', '테니스', '2024-12-22', '제주특별자치도 서귀포시 동홍로99번길 36', '제주', '2024-10-22', '2024-11-22'),
('서울국제배드민턴대회', '배드민턴', '2024-10-20', '서울 송파구 올림픽로 424', '서울', '2024-08-20', '2024-09-20'),
('부산배드민턴챌린지', '배드민턴', '2024-10-27', '부산 동래구 종합운동장로 35-6', '부산', '2024-08-27', '2024-09-27'),
('대구국제배드민턴대회', '배드민턴', '2024-11-03', '대구 북구 고성로 191', '대구', '2024-09-03', '2024-10-03'),
('인천배드민턴챌린지', '배드민턴', '2024-11-10', '인천 연수구 송도동 191-1', '인천', '2024-09-10', '2024-10-10'),
('광주배드민턴오픈', '배드민턴', '2024-11-17', '광주 서구 금화로 278', '광주', '2024-09-17', '2024-10-17'),
('대전국제배드민턴대회', '배드민턴', '2024-11-24', '대전 중구 대종로 373', '대전', '2024-09-24', '2024-10-24'),
('울산배드민턴챌린지', '배드민턴', '2024-12-01', '울산 중구 염포로 85', '울산', '2024-10-01', '2024-11-01'),
('세종배드민턴페스티벌', '배드민턴', '2024-12-08', '세종특별자치시 조치원읍 대첩로 116', '세종', '2024-10-08', '2024-11-08'),
('강원국제배드민턴대회', '배드민턴', '2024-12-15', '강원특별자치도 원주시 서원대로 281', '강원', '2024-10-15', '2024-11-15'),
('제주배드민턴오픈', '배드민턴', '2024-12-22', '제주특별자치도 제주시 서광로2길 24', '제주', '2024-10-22', '2024-11-22');






INSERT INTO detail (category, event_id) VALUES
-- 마라톤 (1~10)
('Full Marathon', 1),
('10km', 1),
('Half Marathon', 2),
('5km', 2),
('Full Marathon', 3),
('Half Marathon', 3),
('10km', 4),
('5km', 4),
('Half Marathon', 5),
('10km', 5),
('5km', 6),
('Full Marathon', 6),
('10km', 7),
('Half Marathon', 7),
('Full Marathon', 8),
('10km', 8),
('Half Marathon', 9),
('5km', 9),
('10km', 10),
('5km', 10),
-- 철인3종 (11~20)
('Olympic Distance', 11),
('Sprint Distance', 11),
('Full Distance', 12),
('Sprint Distance', 12),
('Sprint Distance', 13),
('Relay', 13),
('Olympic Distance', 14),
('Full Distance', 14),
('Relay', 15),
('Sprint Distance', 15),
('Olympic Distance', 16),
('Sprint Distance', 16),
('Full Distance', 17),
('Relay', 17),
('Sprint Distance', 18),
('Relay', 18),
('Olympic Distance', 19),
('Full Distance', 19),
('Relay', 20),
('Sprint Distance', 20),
-- 그랑폰도 (21~30)
('Gran Fondo', 21),
('Medio Fondo', 21),
('Gran Fondo', 22),
('Piccolo Fondo', 22),
('Gravel', 23),
('Piccolo Fondo', 23),
('Gran Fondo', 24),
('Gravel', 24),
('Medio Fondo', 25),
('Gran Fondo', 25),
('Gran Fondo', 26),
('Medio Fondo', 26),
('Piccolo Fondo', 27),
('Gran Fondo', 27),
('Medio Fondo', 28),
('Gravel', 28),
('Gran Fondo', 29),
('Piccolo Fondo', 29),
('Gravel', 30),
('Gran Fondo', 30),
-- 테니스 (31~40)
('Singles', 31),
('Doubles', 31),
('Mixed Doubles', 32),
('Singles', 32),
('Junior', 33),
('Singles', 33),
('Singles', 34),
('Doubles', 34),
('Doubles', 35),
('Mixed Doubles', 35),
('Singles', 36),
('Doubles', 36),
('Mixed Doubles', 37),
('Singles', 37),
('Junior', 38),
('Singles', 38),
('Singles', 39),
('Doubles', 39),
('Doubles', 40),
('Mixed Doubles', 40),
-- 배드민턴 (41~50)
('Men\'s Singles', 41),
('Women\'s Singles', 41),
('Men\'s Doubles', 42),
('Women\'s Doubles', 42),
('Mixed Doubles', 43),
('Junior Singles', 43),
('Men\'s Doubles', 44),
('Mixed Doubles', 44),
('Women\'s Singles', 45),
('Junior Singles', 45),
('Men\'s Singles', 46),
('Mixed Doubles', 46),
('Men\'s Doubles', 47),
('Women\'s Doubles', 47),
('Mixed Doubles', 48),
('Junior Singles', 48),
('Men\'s Singles', 49),
('Women\'s Singles', 49),
('Men\'s Doubles', 50),
('Mixed Doubles', 50);

INSERT INTO participation (memo,completion_time,event_id,user_id, detail) VALUES
('오늘 완주 성공!','04:52:26',1,1,'Full Marathon'),
('오늘 두 번째 완주 성공!','01:02:10',2,1,'5km'),
('힘들어!','01:32:16',4,2, '10km');
