DROP DATABASE IF EXISTS calog;

CREATE DATABASE IF NOT EXISTS calog;

USE calog;

# 유저 테이블
CREATE TABLE user (
	id INT AUTO_INCREMENT PRIMARY KEY,
    user_id VARCHAR(20),
    user_pw VARCHAR(60),
    nickname VARCHAR(30)
);
INSERT INTO user (user_id,user_pw,nickname)VALUES
('abc','123','짱우'),
('ssafy','123','혜만');



# 이벤트 테이블
CREATE TABLE event (
	id INT AUTO_INCREMENT PRIMARY KEY,
    event_name VARCHAR(100),
	sport VARCHAR(10), #마라톤, 배드민턴 등 종목
    event_date DATETIME,
    address VARCHAR(200),
    city VARCHAR(20),
    registration_start DATETIME,
    registration_deadline DATETIME,
    img LONGTEXT
);


# 참가 대회 목록 테이블
CREATE TABLE participation (
		id INT AUTO_INCREMENT PRIMARY KEY,
		memo VARCHAR(255),
        completion_time TIME,
        ranking INT,
        img LONGTEXT,
        detail VARCHAR(60),
        updated_at DATETIME DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
        event_id INT,
        user_id INT,
        FOREIGN KEY (event_id) REFERENCES event(id),
	    FOREIGN KEY (user_id) REFERENCES user(id)
);

-- 같은 유저가 같은 대회에 참여 기록 중복 방지를 위해 유저 아이디와 이벤트 아이디 조합을 유니크 키로 설정

ALTER TABLE participation
ADD UNIQUE KEY (user_id, event_id);

# 상세 대회 정보 테이블
CREATE TABLE detail (
	id INT AUTO_INCREMENT PRIMARY KEY,
    category VARCHAR(50), -- 세부종목 (ex. 5km, 10km)
    event_id INT,
    FOREIGN KEY (event_id) REFERENCES event(id)
);

INSERT INTO event (event_name, sport, event_date, address, city, registration_start, registration_deadline)
VALUES
('서울국제마라톤', '마라톤', '2024-10-20', '서울특별시 송파구 올림픽로 424', '서울', '2024-08-20', '2024-09-20'),
('춘천마라톤', '마라톤', '2024-10-27', '강원도 춘천시 스포츠타운길 113', '강원', '2024-08-27', '2024-09-27'),
('경주국제마라톤', '마라톤', '2024-11-03', '경북 경주시 신평동 375', '경상', '2024-09-03', '2024-10-03'),
('제주국제마라톤', '마라톤', '2024-11-10', '제주특별자치도 제주시 애월읍 곽지리 1565', '제주', '2024-09-10', '2024-10-10'),
('대구국제마라톤', '마라톤', '2024-11-17', '대구 달서구 두류동 산 310-9', '대구', '2024-09-17', '2024-10-17'),
('부산마라톤', '마라톤', '2024-11-24', '부산 해운대구 우동', '부산', '2024-09-24', '2024-10-24'),
('광주마라톤', '마라톤', '2024-12-01', '광주 서구 치평동 1162', '광주', '2024-10-01', '2024-11-01'),
('인천송도마라톤', '마라톤', '2024-12-08', '인천 연수구 송도동 24-5', '인천', '2024-10-08', '2024-11-08'),
('울산마라톤', '마라톤', '2024-12-15', '울산 중구 태화동 107', '울산', '2024-10-15', '2024-11-15'),
('세종마라톤', '마라톤', '2024-12-22', '세종특별자치시 세종동 1201', '세종', '2024-10-22', '2024-11-22'),
('통영트라이애슬론', '철인3종', '2024-10-15', '경남 통영시 도남동', '경상', '2024-08-15', '2024-09-15'),
('서울트라이애슬론', '철인3종', '2024-10-22', '서울 서초구 신반포로11길 40', '서울', '2024-08-22', '2024-09-22'),
('부산트라이애슬론', '철인3종', '2024-11-05', '부산 수영구 광안해변로 219', '부산', '2024-09-05', '2024-10-05'),
('제주트라이애슬론', '철인3종', '2024-11-12', '제주특별자치도 서귀포시 색달동 3039', '제주', '2024-09-12', '2024-10-12'),
('대전트라이애슬론', '철인3종', '2024-11-19', '대전 서구 둔산대로 169', '대전', '2024-09-19', '2024-10-19'),
('광주트라이애슬론', '철인3종', '2024-11-26', '광주 광산구 수완동 1411', '광주', '2024-09-26', '2024-10-26'),
('인천트라이애슬론', '철인3종', '2024-12-03', '인천 중구 북성동1가 125', '인천', '2024-10-03', '2024-11-03'),
('울산트라이애슬론', '철인3종', '2024-12-10', '울산 동구 등대로 140', '울산', '2024-10-10', '2024-11-10'),
('세종트라이애슬론', '철인3종', '2024-12-17', '세종특별자치시 중앙공원로 60', '세종', '2024-10-17', '2024-11-17'),
('강원트라이애슬론', '철인3종', '2024-12-24', '강원특별자치도 강릉시 창해로 514', '강원', '2024-10-24', '2024-11-24');


INSERT INTO event (event_name, sport, event_date, address, city, registration_start, registration_deadline)
VALUES
('서울그란폰도', '그랑폰도', '2024-10-18', '서울 중구 남산공원길 125-54', '서울', '2024-08-18', '2024-09-18'),
('부산그란폰도', '그랑폰도', '2024-10-25', '부산 금정구 금성동 1097', '부산', '2024-08-25', '2024-09-25'),
('대구그란폰도', '그랑폰도', '2024-11-02', '대구 동구 팔공산로185길 51', '대구', '2024-09-02', '2024-10-02'),
('인천그란폰도', '그랑폰도', '2024-11-09', '인천 강화군 불은면 중앙로 602-14', '인천', '2024-09-09', '2024-10-09'),
('광주그란폰도', '그랑폰도', '2024-11-16', '광주 북구 금곡동 산 1-3', '광주', '2024-09-16', '2024-10-16'),
('대전그란폰도', '그랑폰도', '2024-11-23', '대전 대덕구 장동 산 108-1 계족산', '대전', '2024-09-23', '2024-10-23'),
('울산그란폰도', '그랑폰도', '2024-12-01', '울산 울주군 상북면 등억알프스리 산 180', '울산', '2024-10-01', '2024-11-01'),
('세종그란폰도', '그랑폰도', '2024-12-08', '세종특별자치시 한솔동 1249', '세종', '2024-10-08', '2024-11-08'),
('강원그란폰도', '그랑폰도', '2024-12-15', '강원특별자치도 양양군 서면 오색리', '강원', '2024-10-15', '2024-11-15'),
('제주그란폰도', '그랑폰도', '2024-12-22', '제주특별자치도 제주시 구좌읍 종달리 산 28', '제주', '2024-10-22', '2024-11-22'),
('서울오픈테니스대회', '테니스', '2024-10-20', '서울 송파구 올림픽로 25', '서울', '2024-08-20', '2024-09-20'),
('부산오픈테니스대회', '테니스', '2024-10-27', '부산광역시 동래구 사직로 45', '부산', '2024-08-27', '2024-09-27'),
('대구테니스챌린지', '테니스', '2024-11-03', '대구광역시 북구 고성로 191', '대구', '2024-09-03', '2024-10-03'),
('인천국제테니스대회', '테니스', '2024-11-10', '인천광역시 연수구 센트럴로 263', '인천', '2024-09-10', '2024-10-10'),
('광주오픈테니스대회', '테니스', '2024-11-17', '광주 서구 월드컵4강로 277', '광주', '2024-09-17', '2024-10-17'),
('대전테니스챌린지', '테니스', '2024-11-24', '대전 유성구 엑스포로 448', '대전', '2024-09-24', '2024-10-24'),
('울산테니스페스티벌', '테니스', '2024-12-01', '울산 남구 문수로 44', '울산', '2024-10-01', '2024-11-01'),
('세종테니스페스티벌', '테니스', '2024-12-08', '세종특별자치시 조치원읍 대첩로 98', '세종', '2024-10-08', '2024-11-08'),
('강원테니스챌린지', '테니스', '2024-12-15', '강원특별자치도 춘천시 스포츠타운길 124-1', '강원', '2024-10-15', '2024-11-15'),
('제주테니스페스티벌', '테니스', '2024-12-22', '제주특별자치도 서귀포시 동홍로99번길 36', '제주', '2024-10-22', '2024-11-22'),
('서울국제배드민턴대회', '배드민턴', '2024-10-20', '서울 송파구 올림픽로 424', '서울', '2024-08-20', '2024-09-20'),
('부산배드민턴챌린지', '배드민턴', '2024-10-27', '부산 동래구 종합운동장로 35-6', '부산', '2024-08-27', '2024-09-27'),
('대구국제배드민턴대회', '배드민턴', '2024-11-03', '대구 북구 고성로 191', '대구', '2024-09-03', '2024-10-03'),
('인천배드민턴챌린지', '배드민턴', '2024-11-10', '인천 연수구 송도동 191-1', '인천', '2024-09-10', '2024-10-10'),
('광주배드민턴오픈', '배드민턴', '2024-11-17', '광주 서구 금화로 278', '광주', '2024-09-17', '2024-10-17'),
('대전국제배드민턴대회', '배드민턴', '2024-11-24', '대전 중구 대종로 373', '대전', '2024-09-24', '2024-10-24'),
('울산배드민턴챌린지', '배드민턴', '2024-12-01', '울산 중구 염포로 85', '울산', '2024-10-01', '2024-11-01'),
('세종배드민턴페스티벌', '배드민턴', '2024-12-08', '세종특별자치시 조치원읍 대첩로 116', '세종', '2024-10-08', '2024-11-08'),
('강원국제배드민턴대회', '배드민턴', '2024-12-15', '강원특별자치도 원주시 서원대로 281', '강원', '2024-10-15', '2024-11-15'),
('제주배드민턴오픈', '배드민턴', '2024-12-22', '제주특별자치도 제주시 서광로2길 24', '제주', '2024-10-22', '2024-11-22');







INSERT INTO detail (category, event_id) VALUES
-- 마라톤 (1~10)
('Full Marathon', 1),
('10km', 1),
('Half Marathon', 2),
('5km', 2),
('Full Marathon', 3),
('Half Marathon', 3),
('10km', 4),
('5km', 4),
('Half Marathon', 5),
('10km', 5),
('5km', 6),
('Full Marathon', 6),
('10km', 7),
('Half Marathon', 7),
('Full Marathon', 8),
('10km', 8),
('Half Marathon', 9),
('5km', 9),
('10km', 10),
('5km', 10),
-- 철인3종 (11~20)
('Olympic Distance', 11),
('Sprint Distance', 11),
('Full Distance', 12),
('Sprint Distance', 12),
('Sprint Distance', 13),
('Relay', 13),
('Olympic Distance', 14),
('Full Distance', 14),
('Relay', 15),
('Sprint Distance', 15),
('Olympic Distance', 16),
('Sprint Distance', 16),
('Full Distance', 17),
('Relay', 17),
('Sprint Distance', 18),
('Relay', 18),
('Olympic Distance', 19),
('Full Distance', 19),
('Relay', 20),
('Sprint Distance', 20),
-- 그랑폰도 (21~30)
('Gran Fondo', 21),
('Medio Fondo', 21),
('Gran Fondo', 22),
('Piccolo Fondo', 22),
('Gravel', 23),
('Piccolo Fondo', 23),
('Gran Fondo', 24),
('Gravel', 24),
('Medio Fondo', 25),
('Gran Fondo', 25),
('Gran Fondo', 26),
('Medio Fondo', 26),
('Piccolo Fondo', 27),
('Gran Fondo', 27),
('Medio Fondo', 28),
('Gravel', 28),
('Gran Fondo', 29),
('Piccolo Fondo', 29),
('Gravel', 30),
('Gran Fondo', 30),
-- 테니스 (31~40)
('Singles', 31),
('Doubles', 31),
('Mixed Doubles', 32),
('Singles', 32),
('Junior', 33),
('Singles', 33),
('Singles', 34),
('Doubles', 34),
('Doubles', 35),
('Mixed Doubles', 35),
('Singles', 36),
('Doubles', 36),
('Mixed Doubles', 37),
('Singles', 37),
('Junior', 38),
('Singles', 38),
('Singles', 39),
('Doubles', 39),
('Doubles', 40),
('Mixed Doubles', 40),
-- 배드민턴 (41~50)
('Men\'s Singles', 41),
('Women\'s Singles', 41),
('Men\'s Doubles', 42),
('Women\'s Doubles', 42),
('Mixed Doubles', 43),
('Junior Singles', 43),
('Men\'s Doubles', 44),
('Mixed Doubles', 44),
('Women\'s Singles', 45),
('Junior Singles', 45),
('Men\'s Singles', 46),
('Mixed Doubles', 46),
('Men\'s Doubles', 47),
('Women\'s Doubles', 47),
('Mixed Doubles', 48),
('Junior Singles', 48),
('Men\'s Singles', 49),
('Women\'s Singles', 49),
('Men\'s Doubles', 50),
('Mixed Doubles', 50);

INSERT INTO event (event_name, sport, event_date, address, city, registration_start, registration_deadline)
VALUES
-- 마라톤 대회
('씩씩한 마라톤', '마라톤', '2024-09-09', '서울특별시 송파구 올림픽로 424', '서울', '2024-07-09', '2024-08-09'),
('건강한 마라톤', '마라톤', '2024-09-18', '강원도 춘천시 스포츠타운길 113', '강원', '2024-07-18', '2024-08-18'),
('신나는 마라톤', '마라톤', '2024-10-04', '경북 경주시 신평동 375', '경상', '2024-08-04', '2024-09-04'),
('힘찬 마라톤', '마라톤', '2024-10-19', '제주특별자치도 제주시 애월읍 곽지리 1565', '제주', '2024-08-19', '2024-09-19'),
('기운찬 마라톤', '마라톤', '2024-11-06', '대구 달서구 두류동 산 310-9', '대구', '2024-09-06', '2024-10-06'),
('행복한 마라톤', '마라톤', '2024-11-13', '부산 해운대구 우동', '부산', '2024-09-13', '2024-10-13'),
('상쾌한 마라톤', '마라톤', '2024-12-02', '광주 서구 치평동 1162', '광주', '2024-10-02', '2024-11-02'),
('즐거운 마라톤', '마라톤', '2024-12-11', '인천 연수구 송도동 24-5', '인천', '2024-10-11', '2024-11-11'),
('용감한 마라톤', '마라톤', '2024-09-26', '울산 중구 태화동 107', '울산', '2024-07-26', '2024-08-26'),
('평화로운 마라톤', '마라톤', '2024-10-30', '세종특별자치시 세종동 1201', '세종', '2024-08-30', '2024-09-30'),

-- 철인3종 대회
('씩씩한 철인3종', '철인3종', '2024-09-12', '경남 통영시 도남동', '경상', '2024-07-12', '2024-08-12'),
('건강한 철인3종', '철인3종', '2024-09-25', '서울 서초구 신반포로11길 40', '서울', '2024-07-25', '2024-08-25'),
('신나는 철인3종', '철인3종', '2024-10-03', '부산 수영구 광안해변로 219', '부산', '2024-08-03', '2024-09-03'),
('힘찬 철인3종', '철인3종', '2024-10-17', '제주특별자치도 서귀포시 색달동 3039', '제주', '2024-08-17', '2024-09-17'),
('기운찬 철인3종', '철인3종', '2024-11-04', '대전 서구 둔산대로 169', '대전', '2024-09-04', '2024-10-04'),
('행복한 철인3종', '철인3종', '2024-11-14', '광주 광산구 수완동 1411', '광주', '2024-09-14', '2024-10-14'),
('상쾌한 철인3종', '철인3종', '2024-12-05', '인천 중구 북성동1가 125', '인천', '2024-10-05', '2024-11-05'),
('즐거운 철인3종', '철인3종', '2024-12-12', '울산 동구 등대로 140', '울산', '2024-10-12', '2024-11-12'),
('용감한 철인3종', '철인3종', '2024-09-30', '세종특별자치시 중앙공원로 60', '세종', '2024-07-30', '2024-08-30'),
('평화로운 철인3종', '철인3종', '2024-10-25', '강원특별자치도 강릉시 창해로 514', '강원', '2024-08-25', '2024-09-25');


INSERT INTO detail (category, event_id) VALUES
-- 마라톤 (51~60)
('Full Marathon', 51),
('10km', 51),
('Half Marathon', 52),
('5km', 52),
('Full Marathon', 53),
('Half Marathon', 53),
('10km', 54),
('5km', 54),
('Half Marathon', 55),
('10km', 55),
('5km', 56),
('Full Marathon', 56),
('10km', 57),
('Half Marathon', 57),
('Full Marathon', 58),
('10km', 58),
('Half Marathon', 59),
('5km', 59),
('10km', 60),
('5km', 60),

-- 철인3종 (61~70)
('Olympic Distance', 61),
('Sprint Distance', 61),
('Full Distance', 62),
('Sprint Distance', 62),
('Sprint Distance', 63),
('Relay', 63),
('Olympic Distance', 64),
('Full Distance', 64),
('Relay', 65),
('Sprint Distance', 65),
('Olympic Distance', 66),
('Sprint Distance', 66),
('Full Distance', 67),
('Relay', 67),
('Sprint Distance', 68),
('Relay', 68),
('Olympic Distance', 69),
('Full Distance', 69),
('Relay', 70),
('Sprint Distance', 70);

INSERT INTO event (event_name, sport, event_date, address, city, registration_start, registration_deadline)
VALUES
-- 배드민턴
('사과배드민턴챌린지', '배드민턴', '2024-09-16', '서울 송파구 올림픽로 424', '서울', '2024-07-16', '2024-08-16'),
('바나나배드민턴대회', '배드민턴', '2024-09-19', '부산 동래구 종합운동장로 35-6', '부산', '2024-07-19', '2024-08-19'),
('포도배드민턴챌린지', '배드민턴', '2024-09-23', '대구 북구 고성로 191', '대구', '2024-07-23', '2024-08-23'),
('딸기배드민턴오픈', '배드민턴', '2024-10-02', '인천 연수구 송도동 191-1', '인천', '2024-08-02', '2024-09-02'),
('수박배드민턴페스티벌', '배드민턴', '2024-10-04', '광주 서구 금화로 278', '광주', '2024-08-04', '2024-09-04'),
('참외배드민턴챌린지', '배드민턴', '2024-10-10', '대전 중구 대종로 373', '대전', '2024-08-10', '2024-09-10'),
('귤배드민턴오픈', '배드민턴', '2024-10-17', '울산 중구 염포로 85', '울산', '2024-08-17', '2024-09-17'),
('감배드민턴페스티벌', '배드민턴', '2024-11-06', '세종특별자치시 조치원읍 대첩로 116', '세종', '2024-09-06', '2024-10-06'),
('오렌지배드민턴대회', '배드민턴', '2024-11-08', '강원특별자치도 원주시 서원대로 281', '강원', '2024-09-08', '2024-10-08'),
('복숭아배드민턴오픈', '배드민턴', '2024-11-15', '제주특별자치도 제주시 서광로2길 24', '제주', '2024-09-15', '2024-10-15'),

-- 테니스
('치즈테니스대회', '테니스', '2024-09-17', '서울 송파구 올림픽로 25', '서울', '2024-07-17', '2024-08-17'),
('샐러드테니스챌린지', '테니스', '2024-09-18', '부산광역시 동래구 사직로 45', '부산', '2024-07-18', '2024-08-18'),
('커피테니스페스티벌', '테니스', '2024-09-20', '대구광역시 북구 고성로 191', '대구', '2024-07-20', '2024-08-20'),
('스테이크테니스오픈', '테니스', '2024-10-03', '인천광역시 연수구 센트럴로 263', '인천', '2024-08-03', '2024-09-03'),
('파스타테니스대회', '테니스', '2024-10-05', '광주 서구 월드컵4강로 277', '광주', '2024-08-05', '2024-09-05'),
('케이크테니스챌린지', '테니스', '2024-10-11', '대전 유성구 엑스포로 448', '대전', '2024-08-11', '2024-09-11'),
('피자테니스페스티벌', '테니스', '2024-10-19', '울산 남구 문수로 44', '울산', '2024-08-19', '2024-09-19'),
('햄버거테니스대회', '테니스', '2024-11-07', '세종특별자치시 조치원읍 대첩로 98', '세종', '2024-09-07', '2024-10-07'),
('샌드위치테니스챌린지', '테니스', '2024-11-14', '강원특별자치도 춘천시 스포츠타운길 124-1', '강원', '2024-09-14', '2024-10-14'),
('초콜릿테니스오픈', '테니스', '2024-11-21', '제주특별자치도 서귀포시 동홍로99번길 36', '제주', '2024-09-21', '2024-10-21'),

-- 그랑폰도
('딸기그란폰도', '그랑폰도', '2024-09-16', '서울 중구 남산공원길 125-54', '서울', '2024-07-16', '2024-08-16'),
('바나나그란폰도', '그랑폰도', '2024-09-18', '부산 금정구 금성동 1097', '부산', '2024-07-18', '2024-08-18'),
('사과그란폰도', '그랑폰도', '2024-09-20', '대구 동구 팔공산로185길 51', '대구', '2024-07-20', '2024-08-20'),
('파인애플그란폰도', '그랑폰도', '2024-10-02', '인천 강화군 불은면 중앙로 602-14', '인천', '2024-08-02', '2024-09-02'),
('포도그란폰도', '그랑폰도', '2024-10-04', '광주 북구 금곡동 산 1-3', '광주', '2024-08-04', '2024-09-04'),
('복숭아그란폰도', '그랑폰도', '2024-10-10', '대전 대덕구 장동 산 108-1 계족산', '대전', '2024-08-10', '2024-09-10'),
('참외그란폰도', '그랑폰도', '2024-10-17', '울산 울주군 상북면 등억알프스리 산 180', '울산', '2024-08-17', '2024-09-17'),
('귤그란폰도', '그랑폰도', '2024-11-06', '세종특별자치시 한솔동 1249', '세종', '2024-09-06', '2024-10-06'),
('감그란폰도', '그랑폰도', '2024-11-08', '강원특별자치도 양양군 서면 오색리', '강원', '2024-09-08', '2024-10-08'),
('토마토그란폰도', '그랑폰도', '2024-11-15', '제주특별자치도 제주시 구좌읍 종달리 산 28', '제주', '2024-09-15', '2024-10-15');


INSERT INTO detail (category, event_id) VALUES
-- 배드민턴 (71~80)
('Singles', 71),
('Doubles', 71),
('Mixed Doubles', 72),
('Singles', 72),
('Doubles', 73),
('Singles', 73),
('Mixed Doubles', 74),
('Doubles', 74),
('Singles', 75),
('Mixed Doubles', 75),
('Doubles', 76),
('Singles', 76),
('Mixed Doubles', 77),
('Doubles', 77),
('Singles', 78),
('Mixed Doubles', 78),
('Doubles', 79),
('Singles', 79),
('Mixed Doubles', 80),
('Doubles', 80),

-- 테니스 (81~90)
('Singles', 81),
('Doubles', 81),
('Mixed Doubles', 82),
('Singles', 82),
('Doubles', 83),
('Mixed Doubles', 83),
('Singles', 84),
('Mixed Doubles', 84),
('Doubles', 85),
('Singles', 85),
('Mixed Doubles', 86),
('Doubles', 86),
('Singles', 87),
('Doubles', 87),
('Mixed Doubles', 88),
('Singles', 88),
('Doubles', 89),
('Mixed Doubles', 89),
('Singles', 90),
('Doubles', 90),

-- 그랑폰도 (91~100)
('Full Distance', 91),
('Sprint Distance', 91),
('Olympic Distance', 92),
('Full Distance', 92),
('Sprint Distance', 93),
('Relay', 93),
('Olympic Distance', 94),
('Sprint Distance', 94),
('Full Distance', 95),
('Olympic Distance', 95),
('Sprint Distance', 96),
('Relay', 96),
('Full Distance', 97),
('Olympic Distance', 97),
('Sprint Distance', 98),
('Relay', 98),
('Full Distance', 99),
('Olympic Distance', 99),
('Relay', 100),
('Sprint Distance', 100);



INSERT INTO participation (memo,completion_time,event_id,user_id, detail) VALUES
('오늘 완주 성공!','04:52:26',1,1,'Full Marathon'),
('하프 가볍네! 날씨도 완벽했던 날!','02:02:10',3,1,'Half Marathon'),
('첫 풀코스 완주 소리 질러~!','04:52:26',5,1,'Full Marathon'),
('그랑폰도 별 거 없구만!','03:55:24',21,1,'Gran Fondo'),
('나는야 배드민턴 새싹!', '01:10:23', 50, 1, 'Men\'s Doubles'),
('테니스는 내 인생의 행복', '1:11:11', 31, 1, 'Singles'),
('힘들어!','01:32:16',4,2, '10km');

INSERT INTO participation (memo, completion_time, event_id, user_id, detail) VALUES
-- 그랑폰도 (91~100)
('그랑폰도 정말 재밌었다!', '03:45:12', 91, 1, 'Full Distance'),
('Sprint에서 새로운 기록 달성!', '01:15:30', 92, 1, 'Sprint Distance'),
('Olympic 코스에서 친구랑 함께 완주!', '02:25:45', 94, 1, 'Olympic Distance'),
('그랑폰도 풀 코스는 역시 장관이야.', '04:10:20', 95, 1, 'Full Distance'),
('릴레이는 정말 특별한 경험이었다!', '03:30:50', 96, 1, 'Relay'),
('내년에도 도전하고 싶다!', '03:50:40', 99, 1, 'Olympic Distance'),

-- 테니스 (81~90)
('테니스에서 첫 승리! 정말 행복한 순간.', '01:05:45', 81, 1, 'Singles'),
('더블스 경기에서 팀워크 빛났다!', '01:15:30', 83, 1, 'Doubles'),

-- 배드민턴 (71~80)
('싱글스에서 최고의 경기였다!', '00:35:50', 71, 1, 'Singles'),
('믹스더블은 새로운 도전!', '00:55:20', 72, 1, 'Mixed Doubles'),
('더블스에서 파트너와 환상적 호흡!', '01:10:45', 74, 1, 'Doubles'),
('오늘 경기는 정말 치열했다.', '00:45:25', 75, 1, 'Singles');

INSERT INTO participation (memo, completion_time, event_id, user_id, detail) VALUES


-- 철인3종 (11~20)
('Relay로 나갔는데 팀원들이랑 완전 호흡 찰떡이었다!', '04:50:00', 13, 1, 'Relay');

CREATE TABLE favorite (
    id INT AUTO_INCREMENT PRIMARY KEY,
    user_id INT NOT NULL,
    event_id INT NOT NULL,
    updated_at DATETIME DEFAULT CURRENT_TIMESTAMP,
    CONSTRAINT fk_favorites_user FOREIGN KEY (user_id) REFERENCES user(id),
    CONSTRAINT fk_favorites_event FOREIGN KEY (event_id) REFERENCES event(id),
    UNIQUE(user_id, event_id)
);

INSERT INTO favorite (user_id, event_id)
VALUES
(1, 1),
(1, 5),
(1, 10),
(1, 15),
(1, 20),
(1, 25),
(1, 30),
(1, 35),
(1, 40),
(1, 45),
(1, 50),
(1, 55),
(1, 60),
(1, 65),
(1, 70),
(1, 75),
(1, 80),
(1, 85),
(1, 90);

-- 배드민턴,테니스 대회에 참여한 경우 임의로 completion_time으로 기록이 등록되었된 것을 랭킹 기록으로 변경

UPDATE participation p
JOIN event e ON p.event_id = e.id
SET p.ranking = FLOOR(1 + (RAND() * 50))
WHERE e.sport IN ('배드민턴', '테니스');

UPDATE participation p
JOIN event e ON p.event_id = e.id
SET p.completion_time = NULL
WHERE e.sport IN ('테니스', '배드민턴');

